app/views/messages/index.html.erb

    <li>
      <% user = User.find_by(id: message.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]