app/views/messages/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<% user = User.find_by(id: @message.user_id) %>

SELECT "replies".* FROM "replies" WHERE "replies"."message_id" = $1  [["message_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<% @message.replies.each do |reply| %>
  <p>
    <% user = User.find_by(id: reply.user_id) %>