app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Night time"], ["body", "Do you cover your bird?"], ["user_id", 1], ["created_at", "2021-06-25 13:38:36.540765"], ["updated_at", "2021-06-25 13:38:36.540765"]]
---
  def create
    @user = User.find(session[:user_id])
    @message = @user.messages.create(message_params)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @message = Message.find(params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @message = Message.find(params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]
---
  def destroy
    @message = Message.find(params[:id])
    if @message.destroy