app/controllers/replies_controller.rb

INSERT INTO "replies" ("body", "user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "yes"], ["user_id", 1], ["message_id", 3], ["created_at", "2021-06-26 10:51:52.450476"], ["updated_at", "2021-06-26 10:51:52.450476"]]
INSERT INTO "replies" ("user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["message_id", 2], ["created_at", "2021-06-25 13:24:39.410471"], ["updated_at", "2021-06-25 13:24:39.410471"]]
---
  def create
    reply_params
    @reply = Reply.create(user_id: session[:user_id], message_id: @message, body: @body)

    if @reply.save!