app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create

    @user = User.new(user_params)

    if @user.errors.present?
      redirect_to '/users/new', notice: "Please check each field is correctly filled in"
    elsif @user.save